app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT "students".* FROM "students"

  def show
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]